Revit 2024 API
ConnectionValidationWarning Members
The ConnectionValidationWarning type exposes the following members.
Constructors
Name | Description
ConnectionValidationWarning
 Constructor.
Methods
Name | Description
Dispose
Releases all resources used by the ConnectionValidationWarning
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParts
 Get ElementIds of affected parts.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Reason
 Enumeration for reason of warning.
Resolution
 Enumeration for resolution that was applied.
See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace